#pragma once
#include <iostream>
/*
Задание 1
Разработать класс String, который в дальнейшем будет использоваться для работы со строками.
Класс должен содержать:
- Конструктор по умолчанию, позволяющий создать строку
длиной 80 символов;
- Конструктор, позволяющий создавать строку произвольного
размера;
- Конструктор, который создаёт строку и инициализирует её
строкой, полученной от пользователя;
- Конструктор копирования.
Класс должен содержать методы для ввода строк с клавиатуры
и вывода строк на экран.
*/

class String
{
	char* str;

public:
	String(const char* s);
	String();
	String(const String& obj);

	//написать метод для сравнения строк
	int compare(const String& str);


	void enter();
	const char* getstr() const;
	~String();
};

