#pragma once

/*
Создайте класс Worker.
Необходимо хранить данные: ФИО, Должность, Год поступления на работу, Зарплата.
Создать массив объектов.
Вывести:
- список работников, стаж работы которых на данном предприятии превосходит заданное число лет;
- список работников, зарплата которых превосходит заданную;
- список работников, занимающих заданную должность.

Используйте explicit конструктор и константные функции-члены (например, для отображения данных о работнике и т.д.
*/

class Worker
{



};

